import java.util.*;
public class Main {
    public static void main(String[] args) {
       /*Задание 2,8: С помощью цикла for сформируйте строку '123456789' и запишите ее в переменную str.
        */
        String str="";
        for(int i=1;i<10;i++)
        str=str+i;
        System.out.print(str);
        }

    }
