import java.util.*;
public class Main {
    public static void main(String[] args) {
       /*Задание 2,7: Выведите в консоль столбец чисел от 1 до 50.
        */
        for(int i=1;i<51;i++)
            System.out.println(i);
        }

    }
